# Kubernetes CLI & Tools
brew "kubernetes-cli"
brew "k9s"
brew "kind"
brew "k3d"
brew "krew"
brew "helm"
brew "vcluster"
brew "k0sproject/tap/k0sctl"
brew "cilium-cli"
brew "colima"
brew "kubectx"
brew "testkube"
cask "lens"
brew "kubectx"

# GitOps & CI/CD
brew "argocd"
brew "woodpecker-cli"
brew "dagger"

# Infrastructure as Code
brew "pulumi"
brew "opentofu"
brew "ansible"

# Observability & Monitoring
brew "stern"
brew "lazydocker"
brew "prometheus"
brew "otel-cli"

# Security & DevSecOps
brew "aquasecurity/trivy/trivy"
brew "kubescape"
brew "snyk"
brew "kubesec"
brew "sysdig"

# DevOps Essentials
brew "bash"
cask "ghostty"
brew "httpie"
brew "jq"
brew "yq"
brew "fzf"
brew "tldr"
brew "htop"
brew "git"
brew "gnutils"
brew "gnupg"
brew "wireshark"
brew "vim"
brew "qemu"
brew "tmux"
brew "stackit"
cask "cursor"
cash "bettertouchtool"
brew "bruno"

# GitOps Helper & AI Support
brew "k8sgpt"


