# Kubernetes CLI & Tools
brew "kubernetes-cli"
brew "k9s"
brew "kind"
brew "k3d"
brew "krew"
brew "helm"
brew "vcluster"
brew "vnode"
brew "devpod"
brew "k0sproject/tap/k0sctl"
brew "cilium-cli"
brew "colima"

# GitOps & CI/CD
brew "argocd"
tap "woodpecker-ci/tap"
brew "woodpecker-ci/tap/woodpecker-cli"
brew "dagger"

# Infrastructure as Code
brew "pulumi"
brew "opentofu"
brew "ansible"

# Observability & Monitoring
brew "stern"
brew "lazydocker"
brew "prometheus"
tap "open-telemetry/opentelemetry"
brew "open-telemetry/opentelemetry/otel-cli"

# Security & DevSecOps
brew "aquasecurity/trivy/trivy"
brew "kubescape"
brew "snyk"
brew "kubesec"

# DevOps Essentials
brew "httpie"
brew "jq"
brew "yq"
brew "fzf"
brew "tldr"
brew "htop"
brew "git"
brew "gnutils"
brew "gnupg"
brew "wireshark" --with-qt
brew "vim"
brew "qemu"
brew "tmux"
brew "stackit"


# GitOps Helper & AI Support
brew "kubectx"
tap "k8sgpt-ai/tap"
brew "k8sgpt-ai/tap/k8sgpt"

# Optional GUI Tools
cask "lens"#!/bin/bash


brew "k0s"

brew "httpie"

brew "jq"

brew "yq"

brew "fzf"

brew "tldr"

brew "kubectx"

tap "k8sgpt-ai/tap"

brew "k8sgpt-ai/tap/k8sgpt"

brew "testkube"

cask "lens"

cask "cursor"

# Hinweise:

# - kubespray, kratix, octopus, k0rdent sind evtl. manuell zu installieren

EOF

echo "🚀 Starte Installation der Tools ..."

brew bundle --file="$BREWFILE"

echo "✅ Alle verfügbaren Tools wurden installiert."

echo "⚠️ Bitte beachte: Einige Tools wie 'kubespray', 'kratix', 'octopus', 'k0rdent' müssen manuell via GitHub installiert werden." 
